{
  "MenuApplicationDeveloper": {
    "title": "Developer with Web Technology",
    "description": "Primary building dynamic Menu boards  with VUE.js with JSX.  Trying to learn as much as I can to build an efficient and affective application for future team member and achieve clients expectations. Able to leverage my year of engineering experiences to ramp up on applications and start working with PM , QA and other Developers.  I touch multiple application each one slightly different  and able to take a concept or idea and apply it to other to make a better application.",
    "positions": [
      {
        "workingDate": "June 2022 - present",
        "employer": "Stratacache",
        "location": "Dayton, Ohio",
        "jobTitle": "Application Developer",
        "jobResponsibilities": [
          "Utilize JavaScript and Vue JS with Jsx to translate business needs into client-friendly functions",
          "Resolve bug tickets assigned through JIRA, that improves and fixes to web components using modern JavaScript frameworks",
          "Implementing features, maintaining software, and learning proprietary JavaScript frameworks",
          "Create and add to documentation and provide assistance to other team members",
          "Work with other developer with issues on applications"
        ]
      }
    ]
  },
  "AutomotiveDesignEngineering": {
    "title": "Automotive Design Engineering",
    "description": "Join Design group to challenge myself and to learn more about the buisness. To work with client and other groups to build chasises for OEM. Provide support to fellow teamates, due to my experiance performing analysis on simular ",

    "positions": [
      {
        "workingDate": "March 2022 - June 2022",
        "employer": "Ftech R&D North America",
        "location": "Troy, Ohio",
        "jobTitle": "Principal Design Technician",
        "jobResponsibilities": [
          "Create models that meet customer requirements",
          "Apply counter measures that will improve performance / reduce weight and decrease cost",
          "Write detailed technical documents about project results and provide details on areas of improvement.",
          "Keep in comunication with other group keep everyone on the same page and development on schedule",
          "Create 3D CAD models based on concepts that are manufacturable and fit within the specification of the OEM. The 3D Models would have a clean part history allowing ease of updating.",
          "Create accurate 2D drawings with proper GD&T practices.",
          "Build scripts with python that can work flow, improve workflow with CatiaV5 macros"
        ]
      }
    ]
  },

  "AutomotiveValidationEngineering": {
    "title": "Automotive Engineering for the Validation Group",
    "description": "In 2005 I joined the CAE / Validation group, The group was a new group and consist of 4 people including me. I needed to learn on my own, to be adaptable to any new jobs presented to the group. Being a newly establish group I established best practices and methods that are still in use today. In my 10 plus years of experience, I have participated in difficult competitions that challenge the spirit to achieve difficult performance targets. To have the grit to accomplish projects to meet tough deadlines Above all, it is important to me to continually learn from peers and to help others succeed in their careers.",
    "positions": [
      {
        "workingDate": "March 2017 - 2021",
        "employer": "Ftech R&D North America",
        "location": "Troy, Ohio",
        "jobTitle": "Principal Validation Technician",
        "jobResponsibilities": [
          "Provide support and direction for team members in product development and mentor new employees.",
          "Create and modify 3D model to meet requirements defined in the specification documents.",
          "Write detailed technical documents explaining project status and provide details on areas of improvements.",
          "Responsible for implementing workplace improvements, i.e. Visual Basic and Excel Reporting system to help other engineers generate reports. Write Python scripts that help improve work efficiency and accuracy."
        ]
      },
      {
        "workingDate": "March 2013 - 2017",
        "employer": "Ftech R&D North America",
        "location": "Troy, Ohio",
        "jobTitle": "Senior Validation Technician",
        "jobResponsibilities": [
          "Authored technical documents on meshing techniques and methods. The objective was to lay the foundation for future Engineers and Technicians to have the best quality mesh within a reasonable time.",
          "Analysis of suspension systems and components ensuring that targets and design specification are met.",
          "Led the correlation studies on suspension parts by analyzing the differences between the physical test setup and the FEA model. Documented my findings and presented them to the team.",
          "Implemented 3D printer process, defined parameters of modeling, and prepping print for presentations."
        ]
      },
      {
        "workingDate": "March 2005 - 2013",
        "employer": "Ftech R&D North America",
        "location": "Troy, Ohio",
        "jobTitle": "Validation Technician",
        "jobResponsibilities": [
          "Presented at Global Environmental Conference 2012 on Lightweight vehicles achieving better fuel efficiency.",
          "Contributed heavily to the Maker Layout competition for a Rear Sub 2010 to 2011.",
          "Created Finite Element Analysis Models that mimic the designed model and performed multiple analyses to determine performance and provided feedback to improve the model."
        ]
      }
    ]
  }
}
